//████████╗██╗  ██╗███████╗███╗   ██╗██╗   ██╗    ███╗   ███╗██████╗ 
//╚══██╔══╝██║  ██║██╔════╝████╗  ██║██║   ██║    ████╗ ████║██╔══██╗
//   ██║   ███████║█████╗  ██╔██╗ ██║██║   ██║    ██╔████╔██║██║  ██║
//   ██║   ██╔══██║██╔══╝  ██║╚██╗██║██║   ██║    ██║╚██╔╝██║██║  ██║
//   ██║   ██║  ██║███████╗██║ ╚████║╚██████╔╝    ██║ ╚═╝ ██║██████╔╝
//   ╚═╝   ╚═╝  ╚═╝╚══════╝╚═╝  ╚═══╝ ╚═════╝     ╚═╝     ╚═╝╚═════╝ 



// * Project name - THENU- MD - BETA
// * Author - Thenula Panpiti
// * Team - Thenux AI ( One poerson )
// * Version - V6.0.0


// 🧬©Thenu -MD -Beta by Thenux Aiッ


































const _0xc0e751 = _0x1b5e;
(function (_0x92d84b, _0x2b5344) {
    const _0x4de5e6 = _0x1b5e, _0x5471ca = _0x92d84b();
    while (!![]) {
        try {
            const _0x23e53d = parseInt(_0x4de5e6(0x114)) / (0x1120 + 0x20c2 + -0x31e1 * 0x1) * (-parseInt(_0x4de5e6(0x102)) / (-0x236f + -0x1 * 0x1e52 + 0x41c3)) + -parseInt(_0x4de5e6(0x124)) / (0x1 * 0x292 + 0x1715 + -0xcd2 * 0x2) * (-parseInt(_0x4de5e6(0x119)) / (-0xb5e + -0xa0d + 0x1f * 0xb1)) + -parseInt(_0x4de5e6(0x10b)) / (0x1f * -0x14 + 0x1e2e + 0x3 * -0x93f) + parseInt(_0x4de5e6(0x13b)) / (-0xa9 * -0x12 + 0xe01 * -0x2 + 0x1 * 0x1026) + -parseInt(_0x4de5e6(0x12d)) / (0x117 * -0x9 + -0xfd5 * -0x2 + -0x15d4) + parseInt(_0x4de5e6(0x105)) / (0xc94 + -0x1ad * -0x13 + -0x2c63) + parseInt(_0x4de5e6(0x13f)) / (-0x1413 + -0xf14 + 0x2330) * (parseInt(_0x4de5e6(0x11a)) / (-0x1174 + -0x370 * -0x8 + -0xa02));
            if (_0x23e53d === _0x2b5344)
                break;
            else
                _0x5471ca['push'](_0x5471ca['shift']());
        } catch (_0x1393a7) {
            _0x5471ca['push'](_0x5471ca['shift']());
        }
    }
}(_0x207f, -0x13dd0 + 0xad * 0x132c + -0x43c2b));
const {readEnv} = require(_0xc0e751(0xff) + _0xc0e751(0x106)), {cmd, commands} = require(_0xc0e751(0x101));
cmd({
    'pattern': _0xc0e751(0xfc),
    'desc': _0xc0e751(0x11c) + _0xc0e751(0x121),
    'category': 'ai',
    'react': '📩',
    'filename': __filename
}, async (_0x203756, _0x238e04, _0x399322, {
    from: _0x1ef0d3,
    quoted: _0x413313,
    body: _0x3175ce,
    isCmd: _0x430347,
    command: _0x3a8325,
    args: _0xe2d9c7,
    q: _0x2db831,
    isGroup: _0x111631,
    sender: _0x34898,
    senderNumber: _0x116c52,
    botNumber2: _0x29d08c,
    botNumber: _0x2ef96f,
    pushname: _0x50899b,
    isMe: _0x1a49f6,
    isOwner: _0x42c7c8,
    groupMetadata: _0x34605e,
    groupName: _0x481f49,
    participants: _0x3ad3b0,
    groupAdmins: _0x491755,
    isBotAdmins: _0x38a485,
    isAdmins: _0x882db5,
    reply: _0x583e33
}) => {
    const _0x37e100 = _0xc0e751, _0x46703a = {
            'QJvfY': function (_0x519e31) {
                return _0x519e31();
            },
            'bFChM': function (_0x59cf2d, _0x3b7465) {
                return _0x59cf2d < _0x3b7465;
            },
            'cwPtu': _0x37e100(0x13c) + _0x37e100(0x12a) + _0x37e100(0x123) + _0x37e100(0x134) + _0x37e100(0x116) + _0x37e100(0x131) + _0x37e100(0x12c) + _0x37e100(0x13d) + _0x37e100(0x125) + _0x37e100(0x132) + _0x37e100(0xfe) + _0x37e100(0x140),
            'tAvWu': _0x37e100(0x120),
            'VNwTQ': _0x37e100(0xfa) + _0x37e100(0x12b) + _0x37e100(0x133) + 'g',
            'VrECU': function (_0x380cd1, _0x1b6a76) {
                return _0x380cd1(_0x1b6a76);
            }
        };
    try {
        const _0x2b86e4 = await _0x46703a[_0x37e100(0x129)](readEnv);
        let _0x418520 = { 'ai': '' };
        for (let _0x24a942 = -0x2 * 0x511 + -0x41 * -0x61 + 0xe7f * -0x1; _0x46703a[_0x37e100(0x109)](_0x24a942, commands[_0x37e100(0x10e)]); _0x24a942++) {
            commands[_0x24a942][_0x37e100(0x130)] && !commands[_0x24a942][_0x37e100(0xf9) + _0x37e100(0x138)] && (_0x418520[commands[_0x24a942][_0x37e100(0x112)]] += '' + _0x2b86e4[_0x37e100(0x11b)] + commands[_0x24a942][_0x37e100(0x130)] + '\x0a');
        }
        let _0x1314d2 = _0x37e100(0x12e) + _0x50899b + (_0x37e100(0x10f) + _0x37e100(0x141) + _0x37e100(0xfd) + _0x37e100(0x108) + _0x37e100(0x115) + _0x37e100(0x13a) + _0x37e100(0x118) + _0x37e100(0x103) + _0x37e100(0x111) + _0x37e100(0x10a) + _0x37e100(0x100) + _0x37e100(0x11d) + _0x37e100(0x127) + _0x37e100(0x117) + _0x37e100(0x10d) + _0x37e100(0x11f) + _0x37e100(0x104) + _0x37e100(0x10c) + _0x37e100(0x137) + _0x37e100(0x139) + _0x37e100(0x122) + _0x37e100(0x110) + _0x37e100(0x128) + _0x37e100(0x11e)) + _0x418520['ai'] + (_0x37e100(0x126) + _0x37e100(0xfb));
        await _0x203756[_0x37e100(0x135) + 'e'](_0x1ef0d3, {
            'audio': { 'url': _0x46703a[_0x37e100(0x113)] },
            'mimetype': _0x46703a[_0x37e100(0x13e)],
            'ptt': !![]
        }, { 'quoted': _0x238e04 }), await _0x203756[_0x37e100(0x135) + 'e'](_0x1ef0d3, {
            'image': { 'url': _0x46703a[_0x37e100(0x136)] },
            'caption': _0x1314d2
        }, { 'quoted': _0x238e04 });
    } catch (_0x3c83a1) {
        console[_0x37e100(0x12f)](_0x3c83a1), _0x46703a[_0x37e100(0x107)](_0x583e33, '' + _0x3c83a1);
    }
});
function _0x1b5e(_0x561b43, _0x3ac68e) {
    const _0x40267a = _0x207f();
    return _0x1b5e = function (_0x67c39d, _0x56d586) {
        _0x67c39d = _0x67c39d - (0x1da1 + -0x487 + 0x3 * -0x80b);
        let _0x45cddd = _0x40267a[_0x67c39d];
        return _0x45cddd;
    }, _0x1b5e(_0x561b43, _0x3ac68e);
}
function _0x207f() {
    const _0x3f4371 = [
        '3586392JIVlLd',
        'https://gi',
        'ads/main/p',
        'tAvWu',
        '1287GFAjdz',
        '.mp3',
        '​🇭​​🇪​​🇳​​',
        'dontAddCom',
        'https://i.',
        '───●●►\x0a\x20\x20',
        'aimenu',
        '🇺​-​🇲​​🇩​\x20',
        '018-WA0251',
        '../lib/dat',
        '𝓲𝓽𝓲💫\x0a👨🏻‍💻⚟*ᴠᴇ',
        '../command',
        '2rUIWPK',
        '\x0a👨🏻‍💻⚟\x20*ᴄʀᴇᴀᴛ',
        'ᴀᴄᴛ*\x20:\x20htt',
        '6253672YHfUmV',
        'abase',
        'VrECU',
        '​🇲​​🇪​​🇳​​',
        'bFChM',
        '𝓷𝓾𝓵𝓪\x20𝓟𝓪𝓷𝓪𝓹',
        '302965GRNJEc',
        'ps://wa.me',
        'ғᴇᴀᴜᴛᴜʀᴇs)',
        'length',
        '*\x0a\x0a>\x20👨‍💻\x20​🇹​',
        '►\x0a│📜\x20AI\x20CO',
        'ᴏʀ*\x20:\x20\x20𝓣𝓱𝓮',
        'category',
        'cwPtu',
        '798181EPhMPm',
        '🇺​👨‍💻\x0a\x0a👨🏻‍💻⚟\x20*ɴ',
        'SENDER-PRA',
        'ᴇᴅ\x20ʜɪᴅᴅᴇɴ\x20',
        '\x20ᵀʰᵉⁿᵘ⁻ᴹᴰ💫',
        '2582204IcvoQH',
        '12820fKefiU',
        'PREFIX',
        'get\x20bot\x20ai',
        'ʀsɪᴏɴs*\x20:\x20',
        '─────\x0a',
        '💫\x0a👨🏻‍💻⚟\x20*ᴄᴏɴᴛ',
        'audio/mp4',
        '\x20cmd.',
        '────────●●',
        'rabathLK/A',
        '3MPikKj',
        'lugins/bgm',
        '\x0a╰────────',
        '6.0.0\x20(ᴀᴅᴅ',
        'MMANDS\x0a│──',
        'QJvfY',
        'thub.com/p',
        'ibb.co/7JX',
        'aw/refs/he',
        '6015569MthOie',
        '\x0a*👋\x20Hello\x20',
        'log',
        'pattern',
        'BATH-MD-/r',
        '/AUD-20221',
        '7PHG/AI.pn',
        'UTO-VOICE-',
        'sendMessag',
        'VNwTQ',
        '/947570967',
        'mandList',
        '17\x20💫\x0a\x0a╭───',
        'ᴀᴍᴇ\x20ʙᴏᴛ*\x20:'
    ];
    _0x207f = function () {
        return _0x3f4371;
    };
    return _0x207f();
}
